When we want to work with SQL easily in an Ipython notebook, we'll load the ipython-sql [extension](https://github.com/catherinedevlin/ipython-sql). 

If you do not have this extension installed please type 
~~~~
pip install ipython-sql
~~~~

**Note: DO NOT PANIC** 
* Don't worry if you get (a) a big red-highlighted warning or (b) a note that the extension has already been loaded!  As long as your SQL commands work, it's loaded properly!

* If you don't understand all the SQL queries... very soon, you will!

In [1]:
%load_ext sql

Next, we'll load an SQLite database stored as a file as follows:

**NOTE: We load a file below (here, "dataset_1.db", which must be in the same directory as the notebook. You'll use this file throughout the next few lectures and PS1. Make sure to download the from the webpage!!**

In [2]:
%sql sqlite:///dataset_1.db

'Connected: @dataset_1.db'

Lets look at one table from the US National Oceanic and Atmospheric Administration (NOAA) Rainfall dataset- `precipitation_full`- having the following schema:

> * `state_code`
> * `station_id`
> * `year`
> * `month`
> * `day`
> * `hour`
> * `precipitation`
> * `flag_1`
> * `flag_2`

Each tuple in this table describes one hour of rainfall (`precipitation`- in hundredths of an inch) at one station (`station_id`) in one state (`state_code`).  Note that tuples with `hour=25` record the total rainfall for that day, and that we can ignore the values of attributes `flag_1` and `flag_2` for now.

Let's take a look at some sample rows of the table via SQL queries.

Note that you can also load an empty in-memory database using:

``%sql sqlite://``

Now let's try out some queries!  (Don't worry, if you're new to SQL, we'll go over all the syntax in more depth next lecture)

**`%sql` is used for single line SQL commands:**

In [3]:
%sql SELECT * FROM precipitation_full LIMIT 5;

 * sqlite:///dataset_1.db
Done.

[(1, 807, 2013, 9, 1, 1, None, '[', ''),
 (1, 807, 2013, 9, 1, 25, 0, 'I', ''),
 (1, 807, 2013, 9, 30, 24, None, ']', ''),
 (1, 807, 2013, 9, 30, 25, 0, 'I', ''),
 (1, 6303, 2013, 9, 1, 1, 0, 'g', '')]

In [4]:
%sql SELECT COUNT(*) FROM precipitation_full;

 * sqlite:///dataset_1.db
Done.

[(74251,)]

And **`%%sql` is used for multi-line SQL commands:**

In [5]:
%%sql
SELECT SUM(p.precipitation) 
FROM precipitation_full p, states s 
WHERE p.state_code = s.code AND s.abbrev = 'CA';

 * sqlite:///dataset_1.db
Done.

[(31982,)]

We can also work with the output of the queries we issue:

In [7]:
result = %sql SELECT * FROM states;
print (result)

 * sqlite:///dataset_1.db
Done.
+------+----------------------+--------------+
| code |         name         |    abbrev    |
+------+----------------------+--------------+
|  0   |        State         | Abbreviation |
|  1   |       Alabama        |      AL      |
|  2   |       Arizona        |      AZ      |
|  3   |       Arkansas       |      AR      |
|  4   |      California      |      CA      |
|  5   |       Colorado       |      CO      |
|  6   |     Connecticut      |      CT      |
|  7   |       Delaware       |      DE      |
|  8   | District of Columbia |      DC      |
|  9   |       Florida        |      FL      |
|  10  |       Georgia        |      GA      |
|  11  |        Idaho         |      ID      |
|  12  |       Illinois       |      IL      |
|  13  |       Indiana        |      IN      |
|  14  |         Iowa         |      IA      |
|  15  |        Kansas        |      KS      |
|  16  |       Kentucky       |      KY      |
|  17  |      Louisiana       |      LA      |
|  18  |        Maine         |      ME      |
|  19  |       Montana        |      MT      |
|  20  |       Nebraska       |      NE      |
|  21  |        Nevada        |      NV      |
|  22  |    New Hampshire     |      NH      |
|  23  |      New Jersey      |      NJ      |
|  24  |      New Mexico      |      NM      |
|  25  |       New York       |      NY      |
|  26  |    North Carolina    |      NC      |
|  27  |     North Dakota     |      ND      |
|  28  |         Ohio         |      OH      |
|  29  |       Oklahoma       |      OK      |
|  30  |        Oregon        |      OR      |
|  31  |       Maryland       |      MD      |
|  32  |    Massachusetts     |      MA      |
|  33  |       Michigan       |      MI      |
|  34  |      Minnesota       |      MN      |
|  35  |     Mississippi      |      MS      |
|  36  |       Missouri       |      MO      |
|  37  |     Pennsylvania     |      PA      |
|  38  |     Rhode Island     |      RI      |
|  39  |    South Carolina    |      SC      |
|  40  |     South Dakota     |      SD      |
|  41  |      Tennessee       |      TN      |
|  42  |        Texas         |      TX      |
|  43  |         Utah         |      UT      |
|  44  |       Vermont        |      VT      |
|  45  |       Virginia       |      VA      |
|  46  |      Washington      |      WA      |
|  47  |    West Virginia     |      WV      |
|  48  |      Wisconsin       |      WI      |
|  49  |       Wyoming        |      WY      |
|  50  |        Alaska        |      AK      |
|  51  |        Hawaii        |      HI      |
|  66  |     Puerto Rico      |      PR      |
|  67  |    Virgin Islands    |      VI      |
|  91  |   Pacific Islands    |      PI      |
+------+----------------------+--------------+

In [8]:
result.keys

['code', 'name', 'abbrev']

*Note that the first row is the header row with column names!*

In [10]:
result[1]

(1, 'Alabama', 'AL')

In [11]:
result[1].name

'Alabama'

Now feel free to have fun with the dataset- we'll see more of it later though!